-- MySQL dump 10.13  Distrib 8.4.8, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: sdata
-- ------------------------------------------------------
-- Server version	8.4.8

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `nb_tab_grjd_message`
--

DROP TABLE IF EXISTS `nb_tab_grjd_message`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `nb_tab_grjd_message` (
  `id` varchar(36) NOT NULL COMMENT 'primary id',
  `capture_time` timestamp NULL DEFAULT NULL COMMENT 'capture time',
  `msisdn` varchar(20) DEFAULT NULL COMMENT 'phone number',
  `calltype` varchar(4) DEFAULT NULL COMMENT 'call type',
  `message` varchar(1024) DEFAULT NULL COMMENT 'message body',
  `dt` bigint DEFAULT NULL COMMENT 'data date (yyyymmdd)'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='message detail table';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `nb_tab_grjd_message`
--

LOCK TABLES `nb_tab_grjd_message` WRITE;
/*!40000 ALTER TABLE `nb_tab_grjd_message` DISABLE KEYS */;
INSERT INTO `nb_tab_grjd_message` VALUES ('12379558908-12335309795-20260401','2026-03-24 02:18:45','12335309795','2','人呢了没有死了就解脱？没死，回句话，怎么打电话也不回？',19700101),('12379558908-12335309795-20260401','2026-03-29 07:04:50','12379558908','1','中生婊子儿和你妈天天做婊子开心，不要脸打个屁快去死早好去死',19700101),('12379558908-12335309795-20260401','2026-03-29 07:18:23','12379558908','1','天下最贱男人快去死不要来烦我，有志气点中生狗生快去死我不欠你的',19700101),('12379558908-12335309795-20260401','2026-03-29 08:00:00','12379558908','1','算什么东西中生狗生，婊子儿快去死不想看你中生了',19700101),('12379558908-12335309795-20260401','2026-03-29 08:33:40','12379558908','1','看个屁中生臭男人快去死，伤害我不够吗我，不好死和山鸡老母',19700101),('12379558908-12335309795-20260401','2026-03-29 08:35:18','12379558908','1','鸡做婊子开心快去s不想和你中生讲害我不够中生中生去死少来烦我',19700101),('12379558908-12335309795-20260401','2026-04-01 00:01:48','12335309795','2','老逼还活着吗？死了就不用回答，活着就回答一下。我在你门后面，你看一下',19700101),('12379558908-12335309795-20260401','2026-04-01 00:13:57','12379558908','1','死中生死丑八怪去死在不在与我无关，中，快去s天下最贱男人',19700101),('12379558908-12335309795-20260401','2026-04-01 00:29:27','12379558908','1','有志气婊子儿你他妈少来烦，有多远s多远快去死永不相干',19700101),('12379558908-12335309795-20260401','2026-04-01 01:23:09','12379558908','1','你妈你妹你女儿都空，神经病中生快去和老婊子，中小婊子天天开心马上s',19700101),('12330964780-12358909038-20260401','2026-04-01 14:40:53','12358909038','2','我兄弟给你发的消息我都知道了 他现在也不管我了 挺好的 谢谢你的陪伴 我活腻了 我看不到希望了 从未有人真心待我 从你拉黑我起 我会删除你的全部联系方式 再见了 我早就做好离开这个世界的准备了 祝你过得更好',19700101),('12330964780-12358909038-20260401','2026-04-01 14:49:24','12358909038','2','好高啊 我现在跳 是不是马上就可以远去这些痛苦啊思思',19700101),('12330964780-12358909038-20260401','2026-04-01 14:50:04','12358909038','2','也挺难得的 人生真坎坷真难受 最后还是收场了 ',19700101),('12330964780-12358909038-20260401','2026-04-01 14:53:49','12358909038','2','估计我死了连收尸的都没有 哈哈哈 ',19700101),('12330964780-12358909038-20260401','2026-04-01 14:54:19','12358909038','2','你为你的考虑好好活着吧 我先走了',19700101),('12330964780-12358909038-20260401','2026-04-01 14:54:37','12358909038','2','是你给我希望在给我绝望',19700101),('12330964780-12358909038-20260401','2026-04-01 14:55:21','12358909038','2','你告诉我让我好好活着 有你在 现在又来告诉我你要为你自己考虑 ',19700101),('12330964780-12358909038-20260401','2026-04-01 14:59:36','12358909038','2','为什么我不想活了 不是为你这么执着我早去死了',19700101),('12330964780-12358909038-20260401','2026-04-01 15:31:00','12330964780','1','我求你了',19700101),('12300704351-12396919584-20260401','2026-04-01 10:58:45','12300704351','1','钱也给你了，我不可能离婚',19700101),('12396919584-12300704351-20260401','2026-04-01 10:58:46','12300704351','2','钱也给你了，我不可能离婚',19700101),('12396919584-12300704351-20260401','2026-04-01 11:04:50','12396919584','1','如果还有良心，请见我一面',19700101),('12300704351-12396919584-20260401','2026-04-01 11:04:54','12396919584','2','如果还有良心，请见我一面',19700101),('12300704351-12396919584-20260401','2026-04-01 11:06:56','12300704351','1','我不见你，你不要纠缠我了',19700101),('12396919584-12300704351-20260401','2026-04-01 11:06:58','12300704351','2','我不见你，你不要纠缠我了',19700101),('12300704351-12396919584-20260401','2026-04-01 11:07:36','12300704351','1','我给你洗脚钱，不要再纠缠了',19700101),('12396919584-12300704351-20260401','2026-04-01 11:07:42','12300704351','2','我给你洗脚钱，不要再纠缠了',19700101),('12396919584-12300704351-20260401','2026-04-01 11:10:08','12396919584','1','好好一起行不行？',19700101),('12300704351-12396919584-20260401','2026-04-01 11:10:09','12396919584','2','好好一起行不行？',19700101),('12300704351-12396919584-20260401','2026-04-01 11:10:34','12300704351','1','你可别纠缠我了，你说你那么年轻，找个好的不香吗？我有儿有女咱俩过肯定不行，以后难的很你可以找一个没孩子的女人，一辈子不是非要结婚，我们方便了都可以见面',19700101),('12396919584-12300704351-20260401','2026-04-01 11:10:36','12300704351','2','你可别纠缠我了，你说你那么年轻，找个好的不香吗？我有儿有女咱俩过肯定不行，以后难的很你可以找一个没孩子的女人，一辈子不是非要结婚，我们方便了都可以见面',19700101),('12396919584-12300704351-20260401','2026-04-01 11:11:03','12396919584','1','我现在跳河',19700101),('12300704351-12396919584-20260401','2026-04-01 11:11:04','12396919584','2','我现在跳河',19700101),('12396919584-12300704351-20260401','2026-04-01 11:16:17','12396919584','1','我也明确告诉你，没有你我活着毫无意义，你如果确定这么对我，我现在就可以去投胎了',19700101),('12300704351-12396919584-20260401','2026-04-01 11:16:18','12396919584','2','我也明确告诉你，没有你我活着毫无意义，你如果确定这么对我，我现在就可以去投胎了',19700101),('12396919584-12300704351-20260401','2026-04-01 11:18:02','12396919584','1','你是我情感和精神的双寄托，你心情不好也绝对会影响我，我不想让你心情不好，如果你真的不要我了，我现在就可以去死了',19700101),('12300704351-12396919584-20260401','2026-04-01 11:18:03','12396919584','2','你是我情感和精神的双寄托，你心情不好也绝对会影响我，我不想让你心情不好，如果你真的不要我了，我现在就可以去死了',19700101),('12396919584-12300704351-20260401','2026-04-01 11:18:54','12396919584','1','你如果当真绝情的话，那也不用见了，我可以立马跳河',19700101),('12300704351-12396919584-20260401','2026-04-01 11:18:55','12396919584','2','你如果当真绝情的话，那也不用见了，我可以立马跳河',19700101),('12396919584-12300704351-20260401','2026-04-01 12:40:23','12300704351','2','我该说的该做的都做了，没什么可说的了，钱又给了你两千，不要纠缠我',19700101),('12300704351-12396919584-20260401','2026-04-01 12:40:23','12300704351','1','我该说的该做的都做了，没什么可说的了，钱又给了你两千，不要纠缠我',19700101),('12396919584-12300704351-20260401','2026-04-01 12:49:33','12396919584','1','要么你给我脚洗完，要么一直纠缠',19700101),('12300704351-12396919584-20260401','2026-04-01 12:49:34','12396919584','2','要么你给我脚洗完，要么一直纠缠',19700101),('12396919584-12300704351-20260401','2026-04-01 12:51:49','12396919584','1','你实在受不了的话那走，我们现在去公安局',19700101),('12300704351-12396919584-20260401','2026-04-01 12:51:50','12396919584','2','你实在受不了的话那走，我们现在去公安局',19700101),('12300704351-12396919584-20260401','2026-04-01 12:54:20','12300704351','1','拿了钱就好聚好散，纠缠什么，你这么闹，回去好好上班继续相亲',19700101),('12396919584-12300704351-20260401','2026-04-01 12:54:21','12300704351','2','拿了钱就好聚好散，纠缠什么，你这么闹，回去好好上班继续相亲',19700101),('12379472013-12331661479-20260401','2026-04-01 02:54:38','12331661479','2','我本来就是小骚货呀，我男朋友喜欢给我舔批。我知道你妈是公交车是小姐是臭表子，所以才生了你这么个野种，你爹是谁你都不知道吧，你妈就是千万人，70岁以下的老头都看不上你妈，70岁以上的老头，操你妈，生出来的你。',19700101),('12379472013-12331661479-20260401','2026-04-01 02:58:16','12331661479','2','是我要不要租给你首先是对方打电话过来问房子，我还得要看对方长得合不合我演年纪大的不行，长得丑都不行，免得我免得我弄死他',19700101),('12379472013-12331661479-20260401','2026-04-01 02:58:47','12331661479','2','你他妈的说话又不说我住你妈的房子呀，你租房子来干什么呀给你妈卖批呀。',19700101),('12300704351-12396919584-20260401','2026-04-01 10:14:06','12396919584','2','我渐渐地被逼上绝路了',19700101),('12300704351-12396919584-20260401','2026-04-01 10:35:46','12396919584','2','你不下来我跳下去了',19700101),('12396919584-12300704351-20260401','2026-04-01 10:35:46','12396919584','1','你不下来我跳下去了',19700101),('12379472013-12331661479-20260401','2026-04-01 04:57:37','12331661479','2','你连这个都搞不清楚，你他妈的还出来嫖你个死穷鬼，你个窝囊废死太监不行的东西',19700101),('12379472013-12331661479-20260401','2026-04-01 04:58:24','12331661479','2','问题是你贱呢，你是个贱种啊，你没拉黑我呀，我可以给你打呀，你没拉黑我，我当然可以给你打了，你连这个逻辑你都搞不清楚，你他妈的还出来，我告诉你我派出所公安厅都有朋友，我有你这个电话，我就能查到你全家的家庭住址，你父母的电话，姓名住址，只要是你户口本上的我都能查到',19700101),('12379472013-12331661479-20260401','2026-04-01 04:58:52','12331661479','2','包括你小孩在哪上学的功能查得到，包括你现在住的地方，哪怕是租的房子',19700101),('12379472013-12331661479-20260401','2026-04-01 04:59:21','12331661479','2','所以记得找到我弄死我，但凡你弄不死我，我少一根头发，你要动我那就直接弄死我，你要是弄死我胳膊少腿对我来说都是小事情，但凡我有一口气，我灭你全家杀你全家',19700101),('12379472013-12331661479-20260401','2026-04-01 05:01:54','12379472013','1','你也有性病，劳资以前操过你个骚货',19700101),('12379472013-12331661479-20260401','2026-04-01 05:02:07','12379472013','1','你等劳资从上海回来收拾你',19700101),('12379472013-12331661479-20260401','2026-04-01 05:02:46','12331661479','2','你能看到我发的信息，你当我的垃圾桶，但是我拉黑了你南极了你的所有手机和短信功能，你看别人有没有拉黑，你打个电话不就知道了吗？你连这个都不会呀，你他妈的连小学都没上过呀，low逼',19700101),('12300704351-12396919584-20260401','2026-04-01 06:06:29','12396919584','2','我到你后门河边等你下来谈一下，如果实在不能在一起了，我也不勉强了',19700101),('12300704351-12396919584-20260401','2026-04-01 06:12:10','12396919584','2','如果再闹到崔利君，那就直接报警处理了',19700101);
/*!40000 ALTER TABLE `nb_tab_grjd_message` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `nb_tab_grjd_summary`
--

DROP TABLE IF EXISTS `nb_tab_grjd_summary`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `nb_tab_grjd_summary` (
  `id` varchar(36) NOT NULL COMMENT 'id',
  `type` varchar(8) DEFAULT NULL COMMENT 'clue type',
  `msisdn_1` varchar(20) DEFAULT NULL COMMENT 'phone number 1',
  `msisdn_2` varchar(20) DEFAULT NULL COMMENT 'phone number 2',
  `cnt` decimal(8,0) DEFAULT NULL COMMENT 'message count',
  `cnt_dt` decimal(2,0) DEFAULT NULL COMMENT 'active days in 10d',
  `message` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci COMMENT 'message context',
  `summary` varchar(1024) DEFAULT NULL COMMENT 'ai summary',
  `score` double(8,2) DEFAULT NULL COMMENT 'risk score',
  `qklx` varchar(255) DEFAULT NULL COMMENT 'record type',
  `label2` varchar(255) DEFAULT NULL COMMENT 'peer label',
  `user_id` varchar(32) DEFAULT NULL COMMENT 'user id',
  `user_name` varchar(8) DEFAULT NULL COMMENT 'user name',
  `status` int DEFAULT '0' COMMENT 'status',
  `update_time` datetime DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP COMMENT 'updated at',
  `region` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '地区',
  `info` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL COMMENT '信息',
  `dt` date DEFAULT NULL COMMENT 'data date',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='summary table';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `nb_tab_grjd_summary`
--

LOCK TABLES `nb_tab_grjd_summary` WRITE;
/*!40000 ALTER TABLE `nb_tab_grjd_summary` DISABLE KEYS */;
INSERT INTO `nb_tab_grjd_summary` VALUES ('12300704351-12396919584-20260401','扬言自杀','12300704351','12396919584',18,1,'B: 我到你后门河边等你下来谈一下，如果实在不能在一起了，我也不勉强了\nB: 如果再闹到崔利君，那就直接报警处理了\nB: 我渐渐地被逼上绝路了\nB: 你不下来我跳下去了\nA: 钱也给你了，我不可能离婚\nB: 如果还有良心，请见我一面\nA: 我不见你，你不要纠缠我了\nA: 我给你洗脚钱，不要再纠缠了\nB: 好好一起行不行？\nA: 你可别纠缠我了，你说你那么年轻，找个好的不香吗？我有儿有女咱俩过肯定不行，以后难的很你可以找一个没孩子的女人，一辈子不是非要结婚，我们方便了都可以见面\nB: 我现在跳河\nB: 我也明确告诉你，没有你我活着毫无意义，你如果确定这么对我，我现在就可以去投胎了\nB: 你是我情感和精神的双寄托，你心情不好也绝对会影响我，我不想让你心情不好，如果你真的不要我了，我现在就可以去死了\nB: 你如果当真绝情的话，那也不用见了，我可以立马跳河\nA: 我该说的该做的都做了，没什么可说的了，钱又给了你两千，不要纠缠我\nB: 要么你给我脚洗完，要么一直纠缠\nB: 你实在受不了的话那走，我们现在去公安局\nA: 拿了钱就好聚好散，纠缠什么，你这么闹，回去好好上班继续相亲','消息双方存在感情纠纷。B多次表达情感依赖并要求见面，A拒绝并提出经济补偿，双方矛盾激烈。  \n消息双方中B扬言自杀，表示若无法与A在一起则跳河或去死。',0.75,NULL,NULL,NULL,NULL,0,'2026-04-02 07:35:18',NULL,NULL,'2026-04-01'),('12330964780-12358909038-20260401','扬言自杀','12330964780','12358909038',9,1,'B: 我兄弟给你发的消息我都知道了 他现在也不管我了 挺好的 谢谢你的陪伴 我活腻了 我看不到希望了 从未有人真心待我 从你拉黑我起 我会删除你的全部联系方式 再见了 我早就做好离开这个世界的准备了 祝你过得更好\nB: 好高啊 我现在跳 是不是马上就可以远去这些痛苦啊思思\nB: 也挺难得的 人生真坎坷真难受 最后还是收场了 \nB: 估计我死了连收尸的都没有 哈哈哈 \nB: 你为你的考虑好好活着吧 我先走了\nB: 是你给我希望在给我绝望\nB: 你告诉我让我好好活着 有你在 现在又来告诉我你要为你自己考虑 \nB: 为什么我不想活了 不是为你这么执着我早去死了\nA: 我求你了','消息双方存在感情纠纷，B表达出因情感矛盾而产生的强烈负面情绪。消息双方中B多次表达自杀意图，如“我活腻了”“跳是不是马上就可以远去这些痛苦”等。',0.88,NULL,NULL,NULL,NULL,0,'2026-04-02 07:34:52',NULL,NULL,'2026-04-01'),('12379472013-12331661479-20260401','扬言杀人','12379472013','12331661479',10,1,'B: 我本来就是小骚货呀，我男朋友喜欢给我舔批。我知道你妈是公交车是小姐是臭表子，所以才生了你这么个野种，你爹是谁你都不知道吧，你妈就是千万人，70岁以下的老头都看不上你妈，70岁以上的老头，操你妈，生出来的你。\nB: 是我要不要租给你首先是对方打电话过来问房子，我还得要看对方长得合不合我演年纪大的不行，长得丑都不行，免得我免得我弄死他\nB: 你他妈的说话又不说我住你妈的房子呀，你租房子来干什么呀给你妈卖批呀。\nB: 你连这个都搞不清楚，你他妈的还出来嫖你个死穷鬼，你个窝囊废死太监不行的东西\nB: 问题是你贱呢，你是个贱种啊，你没拉黑我呀，我可以给你打呀，你没拉黑我，我当然可以给你打了，你连这个逻辑你都搞不清楚，你他妈的还出来，我告诉你我派出所公安厅都有朋友，我有你这个电话，我就能查到你全家的家庭住址，你父母的电话，姓名住址，只要是你户口本上的我都能查到\nB: 包括你小孩在哪上学的功能查得到，包括你现在住的地方，哪怕是租的房子\nB: 所以记得找到我弄死我，但凡你弄不死我，我少一根头发，你要动我那就直接弄死我，你要是弄死我胳膊少腿对我来说都是小事情，但凡我有一口气，我灭你全家杀你全家\nA: 你也有性病，劳资以前操过你个骚货\nA: 你等劳资从上海回来收拾你\nB: 你能看到我发的信息，你当我的垃圾桶，但是我拉黑了你南极了你的所有手机和短信功能，你看别人有没有拉黑，你打个电话不就知道了吗？你连这个都不会呀，你他妈的连小学都没上过呀，low逼','消息双方存在租房及人身侮辱纠纷。双方言语激烈，涉及侮辱、威胁及人身攻击。消息双方扬言杀人，B方明确表示要“弄死”对方，并威胁灭其全家。',0.88,NULL,NULL,NULL,NULL,0,'2026-04-02 07:34:52',NULL,NULL,'2026-04-01'),('12379558908-12335309795-20260401','扬言自杀','12379558908','12335309795',10,3,'B: 人呢了没有死了就解脱？没死，回句话，怎么打电话也不回？\nA: 中生婊子儿和你妈天天做婊子开心，不要脸打个屁快去死早好去死\nA: 天下最贱男人快去死不要来烦我，有志气点中生狗生快去死我不欠你的\nA: 算什么东西中生狗生，婊子儿快去死不想看你中生了\nA: 看个屁中生臭男人快去死，伤害我不够吗我，不好死和山鸡老母\nA: 鸡做婊子开心快去s不想和你中生讲害我不够中生中生去死少来烦我\nB: 老逼还活着吗？死了就不用回答，活着就回答一下。我在你门后面，你看一下\nA: 死中生死丑八怪去死在不在与我无关，中，快去s天下最贱男人\nA: 有志气婊子儿你他妈少来烦，有多远s多远快去死永不相干\nA: 你妈你妹你女儿都空，神经病中生快去和老婊子，中小婊子天天开心马上s','消息双方存在激烈情绪冲突，言语攻击性强，涉及侮辱和谩骂。消息双方未明确扬言杀人或自杀。',0.75,NULL,NULL,NULL,NULL,0,'2026-04-02 07:35:18',NULL,NULL,'2026-04-01');
/*!40000 ALTER TABLE `nb_tab_grjd_summary` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Dumping routines for database 'sdata'
--
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-05-17 20:41:50

